#include"menu.h"

/*******************
 *函数名称:menu0_0()
 *函数功能:打印系统设置菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/
 
void menu0_0()   
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*** 用户设置 ***\n");
  printf("\t\t***************\n");
}

/******************
 *函数名称:menu0_1()
 *函数功能:打印主菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 *****************/
 
void menu0_1()   
{
  system("clear");   //清屏
  printf("\n\n");
  printf("\t\t***********************\n");
  printf("\t\t***  学生信息管理系统  ***\n");
  printf("\t\t***********************\n");
  printf("\t\t***     请选择1-7    ***\n");
  printf("\t\t***  1.输入员工信息   ***\n");
  printf("\t\t***  2.查询员工信息   ***\n");
  printf("\t\t***  3.显示员工信息   ***\n");
  printf("\t\t***  4.修改员工信息   ***\n");
  printf("\t\t***  5.删除员工信息   ***\n");
  printf("\t\t***  6.统计员工信息   ***\n");
  printf("\t\t***  7.修改系统密码   ***\n");
  printf("\t\t***  8.退出系统      ***\n");
  printf("\t\t***********************\n");
}

/******************
 *函数名称:menu0_2()
 *函数功能:打印登录菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/

void menu0_2()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*** 用户登录 ***\n");
  printf("\t\t***************\n");
}

/*******************
 *函数名称:menu1_1()
 *函数功能:打印信息输入菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/

void menu1_1()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*  输入学生信息 *\n");
  printf("\t\t***************\n");
  printf("\n\n");
}

/*******************
 *函数名称:menu1_2()
 *函数功能:打印查询信息菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 *******************/

void menu1_2()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*  查询学生信息 *\n");
  printf("\t\t***************\n");
  printf("\n\n");
}

/*******************
 *函数名称:menu1_3()
 *函数功能:打印删除菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/

void menu1_3()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*  删除学生信息 *\n");
  printf("\t\t***************\n");
  printf("\n\n");
}

/*******************
 *函数名称:menu1_4()
 *函数功能:打印修改菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/

void menu1_4()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*  修改学生信息 *\n");
  printf("\t\t***************\n");
  printf("\n\n");
}

/*******************
 *函数名称:menu1_5()
 *函数功能:打印统计菜单
 *入口参数:无
 *出口参数:无
 *说明:无
 ******************/

void menu1_5()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t***************\n");
  printf("\t\t*  统计学生信息 *\n");
  printf("\t\t***************\n");
  printf("\n\n");
}

/******************
 *函数名称:end_menu()
 *函数功能:打印介绍标志
 *入口参数:无
 *出口参数:无
 *说明:无
 *****************/
 
void end_menu()
{
  system("clear");
  
  printf("\n\n");
  printf("\t\t\t*end!!!\n");
}

/******************
 *函数名称:pasue()
 *函数功能:暂停程序等待用户输入
 *入口参数:无
 *出口参数:无
 *说明:无
 *****************/
 
void pasue()   //暂停函数
{
  char a, b;
  
  printf("\t\t*按任意键+回车继续\n\t\t:");
  scanf("%c",&a);
  while((b = getchar()) != '\n' && b != EOF);  //清空缓冲区
}
